Metodos/ajuste.xml

<?xml version="1.0" encoding="UTF-8"?>

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:ns1="https://sandbox.epagos.com.ar/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">

<soapenv:Header />

<soapenv:Body>

<ns1:solicitud_pago soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">

<version xsi:type="xsd:string">?</version>

<tipo_operacion xsi:type="ns0:TipoOperacion">op_pago</tipo_operacion>

<credenciales xsi:type="ns0:DatosCredencialesPago">

    <id_organismo xsi:type="xsd:int">32</id_organismo>

    <token xsi:type="xsd:string">35673830bc738823ec02a6ad0898f55a</token>

</credenciales>

<operacion xsi:type="ns0:DatosOperacionPago">

    <numero_operacion xsi:type="xsd:string">1</numero_operacion>

    <identificador_externo_2 xsi:type="xsd:string">17080520200000114400175552020324000105000000000003</identificador_externo_2>

    <identificador_externo_3 xsi:type="xsd:string" />

    <id_moneda_operacion xsi:type="xsd:int">1</id_moneda_operacion>

    <monto_operacion xsi:type="xsd:float">1050.00</monto_operacion>

    <opc_pdf xsi:type="xsd:boolean">0</opc_pdf>

    <opc_fecha_vencimiento xsi:type="xsd:date">2020-11-19</opc_fecha_vencimiento>

    <detalle_operacion SOAP-ENC:arrayType="ns1:DetallePago[2]" xsi:type="ns1:DetallePagoArray">

        <item xsi:type="ns1:DetallePago">

            <id_item xsi:type="xsd:int">1</id_item>

            <desc_item xsi:type="xsd:string">Tasa:805 Año:2020 Comp:000011440 Iden:00000017555 17080520200000114400175552020324000105000000000003</desc_item>

            <monto_item xsi:type="xsd:float">1050.00</monto_item>

            <cantidad_item xsi:type="xsd:int">1</cantidad_item>

        </item>

    </detalle_operacion>

    <opc_devolver_qr xsi:type="xsd:boolean">1</opc_devolver_qr>

    <opc_devolver_codbarras xsi:type="xsd:boolean">1</opc_devolver_codbarras>

    <detalle_operacion soapenc:arrayType="ns0:DetallePago[]" xsi:type="ns0:DetallePagoArray" />

    <fecha_2do_venc xsi:type="xsd:date" />

    <monto_operacion_2do_venc xsi:type="xsd:float" />

    <pagador xsi:type="ns0:DatosPagadorPago">

        <nombre_pagador xsi:type="xsd:string">1</nombre_pagador>

        <apellido_pagador xsi:type="xsd:string">1</apellido_pagador>

        <fechanac_pagador xsi:type="xsd:date" />

        <email_pagador xsi:type="xsd:string">1</email_pagador>

        <identificacion_pagador xsi:type="ns1:IdentificacionPagador">

            <tipo_doc_pagador xsi:type="xsd:int">1</tipo_doc_pagador>

            <numero_doc_pagador xsi:type="xsd:long">1</numero_doc_pagador>

            <cuit_doc_pagador xsi:type="xsd:long">1</cuit_doc_pagador>

        </identificacion_pagador>

        <domicilio_pagador xsi:type="ns0:DomicilioPagador">

            <calle_dom_pagador xsi:type="xsd:string" />

            <numero_dom_pagador xsi:type="xsd:string" />

            <adicional_dom_pagador xsi:type="xsd:string" />

            <cp_dom_pagador xsi:type="xsd:string" />

            <ciudad_dom_pagador xsi:type="xsd:string" />

            <provincia_dom_pagador xsi:type="xsd:int" />

            <pais_dom_pagador xsi:type="xsd:int" />

        </domicilio_pagador>

        <telefono_pagador xsi:type="ns0:TelefonoPagador">

            <codigo_telef_pagador xsi:type="xsd:int" />

            <numero_telef_pagador xsi:type="xsd:int" />

        </telefono_pagador>

        <cbu_pagador xsi:type="xsd:string" />

    </pagador>

</operacion>

<fp soapenc:arrayType="ns0:DatosFormaPago[1]" xsi:type="ns0:DatosFormaPagoArray">

    <item xsi:type="ns0:DatosFormaPago">

        <id_fp xsi:type="xsd:int">34</id_fp>

        <monto_fp xsi:type="xsd:float">1050.00</monto_fp>

        <tarjeta xsi:type="api:FormaPagoTarjeta" />

    </item>

</fp>

<convenio xsi:type="xsd:int">3032</convenio>

</ns1:solicitud_pago>

</soapenv:Body>

</soapenv:Envelope>